Revit 2024 API
RibbonButtonOptions Class
 A utility class containing the Revit.ini options settings related to ribbon buttons
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public class RibbonButtonOptions : IDisposable
Visual Basic
Public Class RibbonButtonOptions _
	Implements IDisposable
Visual C++
public ref class RibbonButtonOptions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RibbonButtonOptions
See Also
RibbonButtonOptions Members
Autodesk.Revit.UI Namespace